Tekla Open API Reference for Tekla Structures 2025
DimensionPlacingAttributes Constructor
Overload List
Name | Description
DimensionSetBaseAttributes.DimensionPlacingAttributes()
 Creates a new dimension placing attributes instance. The placing is set to the free placing.
DimensionSetBaseAttributes.DimensionPlacingAttributes(DimensionSetBaseAttributes.Placings, PlacingDirectionAttributes, PlacingDistanceAttributes)
 Creates a new dimension placing attributes instance with the given parameters.
Top
See Also
Reference
DimensionSetBaseAttributes.DimensionPlacingAttributes Class
Tekla.Structures.Drawing Namespace